configuration/src/InformationRegisters/SynchronizationCircuit/SynchronizationCircuit.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SynchronizationCircuit</name>
  <resources>
    <name>NodeName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>125</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PeerInfobaseNodeName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>125</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IsSyncDeleted</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>LatestUpdate</name>
    <comment>Время по Гринвичу</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Looping</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>InfobaseNode</name>
    <comment>ACC:1330 универсальный механизм</comment>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>NodeCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>CorrespondentNodeCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ObjectsUnregisteredDuringLoop/ObjectsUnregisteredDuringLoop.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ObjectsUnregisteredDuringLoop</name>
  <resources>
    <name>InformationRegisterName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>InformationRegisterChanges</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ObjectPresentation</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>InfobaseNode</name>
    <comment>ACC:1330 универсальный механизм</comment>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Object</name>
    <comment>ACC:1330 универсальный механизм</comment>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>InformationRegisterKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/CommonModules/DataExchangeInternalPublicationClient/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region Internal

Procedure HandleURLInNodeForm(Form, URL, StandardProcessing) Export
	
 	StandardProcessing = False;
	
	If URL = "FormSynchronizationLoop" Then
		
		OpenForm("InformationRegister.SynchronizationCircuit.Form.SynchronizationLoop");
		
	ElsIf URL = "FormObjectsUnregisteredWhileLooping" Then
		
		FormParameters = New Structure("InfobaseNode", Form.Object.Ref);
		OpenForm("InformationRegister.ObjectsUnregisteredDuringLoop.ListForm", 
			FormParameters, Form);
			
	ElsIf URL = "FormMigrationToExchangeOverInternetWizardInternalPublication" Then
		
		FormParameters = New Structure("ExchangeNode", Form.Object.Ref);
		OpenForm("DataProcessor.DataExchangeCreationWizard.Form.MigrationToExchangeOverInternet", 
			FormParameters, Form,,,,, FormWindowOpeningMode.LockOwnerWindow);
		
	ElsIf URL = "ShouldMutePromptToMigrateToWebService" Then
		
		CommonClientServer.SetFormItemProperty(Form.Items, 
			"MigrationToWebService", "Visible", False);
		
		DataExchangeInternalPublicationServerCall.SettingFlagShouldMutePromptToMigrateToWebService(Form.Object.Ref, True);
	
	EndIf;
	
EndProcedure

#EndRegion
